#####################
# Homebrew formulae
#####################
# taps
tap "daipeihust/tap"    # im-select
tap "ryooooooga/tap"    # zabrze
tap "laishulu/homebrew" # macism
tap "hashicorp/tap"     # terraform

# git
brew "git"
brew "gh"         # command line
brew "git-delta"  # diff highlight 
brew "lazygit"    # tui

# editor
brew "neovim"
brew "im-select"  # switch ime in shell
brew "macism"     # for im-select.nvim

# shell
brew "starship"   # customize prompt
brew "sheldon"    # plugin manager
brew "fzf"			  # fuzzy finder
brew "ripgrep"    # search text
brew "bat"        # cat clone(used by fzf)
brew "eza"        # alternative to ls
brew "fd"         # alternative to find
brew "gomi"       # alternative to rm
brew "zoxide"     # alternative to cd
brew "zabrze"     # expand abbreviatioin

# database
brew "libpq"      # PostgresQL library
brew "pgcli"      # REPL for PostgresQL 
brew "sqldiff"    # atabase schema diff

# infra
brew "awscli"
brew "terraform"
brew "lazydocker" # docker tui
brew "hadolint"   # linter for docker

# languages
brew "mise"       # dev tool manager
brew "luarocks"   # lua package manager
brew "shellcheck" # shell lint

# others
brew "jq"         # json parser

#######################
# Homebrew casks
#######################
# gui
cask "raycast"
cask "wezterm"
cask "warp"
cask "docker"
cask "dbeaver-community"
cask "karabiner-elements"
cask "visual-studio-code"
cask "cursor"
cask "google-cloud-sdk"

# fonts
cask "font-cica"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-plemol-jp"
cask "font-plemol-jp-nf"
cask "font-plemol-jp-hs"

# ai
brew "cursor-cli"

# others
cask "session-manager-plugin" # aws session manager
